Repository: sambar-fgfs/Kanboard-documentation-ja
Catalog: resource/kanboard-documentation-ja.tmx
Source language: en_us
Languages: ja

source: From the git repository (development version) ---------------------------------------------
ja: Gitリポジトリからインストール (開発版) ---------------------------------------------

source: - Purpose: **Fetch single metadata value**
ja: - 用途: **単一のメタデータの値を取得する**

source: // LDAP username to use with proxy mode // LDAP username pattern to use with user mode define('LDAP_USERNAME', null);
ja: // proxy modeで使用するLDAP ユーザー名 // userモードで使用する LDAPユーザー名のパターン define('LDAP_USERNAME', null);

source: // LDAP group filter // Example for ActiveDirectory: (&(objectClass=group)(sAMAccountName=%s*)) define('LDAP_GROUP_FILTER', '');
ja: // LDAP グループフィルター // ActiveDirectoryの例 : (&(objectClass=group)(sAMAccountName=%s*)) define('LDAP_GROUP_FILTER', '');

source: :alt: Subtask time tracking
ja: :alt: サブタスクの時間追跡

source: figure:: /_static/show-column.png :alt: Show a column
ja: figure:: /_static/show-column.png :alt: カラムを表示

source: Kanboard is not perfect but there are many ways to help:
ja: Kanboardは完全ではないので、様々な方法で手伝うことができます:

source: - Every day, the number of tasks is recorded for each column.
ja: - 各カラム事のタスク数が毎日記録されます。

source: Let’s say we have two projects: “Customer orders” and “Production”.
ja: “受注対応” と “生産” の2つのプロジェクトが存在するケースで説明します。

source: // LDAP attribute for username
ja: // LDAP 属性でのユーザー名

source: Why minified files are committed into the source tree?
ja: なぜ縮小版ファイルをソースツリーにコミットするのでしょう？

source: - Purpose: **Get comment information**
ja: - 用途: **コメントの情報を取得する**

source: figure:: /_static/dropdown-screenshot.png :alt: Drop-down screenshot menu
ja: figure:: /_static/dropdown-screenshot.png :alt: ドロップダウンからのスクリーンショット追加

source: - Result on success: **column properties**
ja: - 成功時の返り値: **カラムのプロパティ**

source: Show tasks based on the creation date:
ja: 作成日に基づいてタスクを表示:

source: - The description is visible as a tooltip on the board and on the projects listing page.
ja: - プロジェクトの説明はボード上でツールチップとして表示され、また概要ページで表示されます。

source: Run the installer ``vcredist_x64.exe`` or ``vcredist_x86.exe`` according to your platform
ja: インストール先のプラットフォームに合わせて ``vcredist_x64.exe`` か ``vcredist_x86.exe`` のインストーラを実行する

source: Search by task id or title ~~~~~~~~~~~~~~~~~~~~~~~~~~
ja: タスクIDかタスク名で検索 ~~~~~~~~~~~~~~~~~~~~~~~~~~

source: Request example to fetch all the metada of a task:
ja: タスクの全てのメタデータを取得するリクエストの例:

source: Send a `pull-request with Github <https://help.github.com/articles/using-pull-requests/>`__
ja: `Githubにプルリクエストを送る <https://help.github.com/articles/using-pull-requests/>`__

source: If SELinux is enabled, be sure that the Apache user can write to the directory data:
ja: SELinux が有効な場合、必ずApacheを実行するユーザーがディレクトリのデータに書き込みできるようにしなければなりません:

source: // LDAP attribute for user full name
ja: // LDAP 属性のユーザーのフルネーム

source: // In case the username is not an email address, it // will be updated automatically as USER@mydomain.com define('REVERSE_PROXY_DEFAULT_DOMAIN', 'mydomain.com');
ja: // ユーザー名がEmailアドレスで無い場合、自動的に USER@mydomain.comに更新されるでしょう。 define('REVERSE_PROXY_DEFAULT_DOMAIN', 'mydomain.com');

source: - Purpose: **Get my overdue tasks**
ja: - 用途: **自分の期限切れタスクを取得する**

source: - Use a LDAP server that supports ``memberOf`` or ``memberUid`` (PosixGroups)
ja: - 使用しているLDAPサーバーが ``memberOf`` か ``memberUid`` (PosixGroups) をサポートしている

source: Allow people to create tasks only in specific columns '''''''''''''''''''''''''''''''''''''''''''''''''''''
ja: 特定のカラムにのみタスクの作成を許可する '''''''''''''''''''''''''''''''''''''''''''''''''''''

source: export:subtasks Subtasks CSV export
ja: export:subtasks サブタスクをCSVでエクスポート

source: // This filter is used to find the groups of our user
ja: // このフィルターはユーザーがグループを探すのに使用されます

source: - New subtask = **s**
ja: - サブタスクを追加 = **s**

source: - Select **Add by URL** from the menu.
ja: - メニューから **URLで追加** を選択する

source: - Password: API token on the settings page
ja: - Password: 設定ページにあるAPIトークン

source: - Result on success: **task_link_id**
ja: - 成功時の返り値: **task_link_id**

source: From templates, you have to use the helper ``Kanboard\Helper\Url``.
ja: テンプレートより、ヘルパー ``Kanboard\Helper\Url`` を使う必要があります.

source: The process could be summarized to simply copy your data folder to the new Kanboard folder.
ja: この手順を要約すると、単純にdataフォルダを新しいKanboardフォルダにコピーするだけです。

source: - Purpose: **Get default task color**
ja: - 用途: **既定のタスクの色を取得する**

source: - The ``system`` driver use the built-in PHP logger which could be configured in the `php.ini <http://php.net/manual/en/errorfunc.configuration.php#ini.error-log>`__.
ja: - ``system`` ドライバは `php.ini <http://php.net/manual/en/errorfunc.configuration.php#ini.error-log>`__ 内で設定したビルトインのPHPロガーを使用します。

source: Attribute: **link**
ja: 属性: **link**

source: - Purpose: **Get all groups for a given user**
ja: - 用途: **ユーザーが所属している全てのグループを取得する**

source: Add a new action, choose “Start a program” and select the batch file created above
ja: 新しい操作の追加で、"プログラムの開始"を選択し、先に作成したバッチファイルを選択してください。

source: // Default domain to use for setting the email address define('REVERSE_PROXY_DEFAULT_DOMAIN', '');
ja: // Emailアドレスとして設定するように使用するデフォルトのドメイン define('REVERSE_PROXY_DEFAULT_DOMAIN', '');

source: - To develop a quality application, you have to use the official SDK of each platform.
ja: - 高品質なアプリケーションを開発するには、個々のプラットフォームごとに公式なSDKを使わなければなりません。

source: Keyboard Shortcuts ==================
ja: ショートカットキー ==================

source: Do this
ja: やるべき事

source: Attach metadata to tasks and remove them ----------------------------------------
ja: メタデータをタスクに添付/削除する ----------------------------------------

source: - Result on failure: **empty list**
ja: - 失敗時の返り値: **空のリスト**

source: - Reports and analytics (calculate daily stats of each projects)
ja: - レポートと統計(個々のプロジェクトの毎日の統計の計算)

source: Introduction ============
ja: イントロダクション ============

source: - Edit task = **e**
ja: - タスクの編集 = **e**

source: - Query with the full name: ``assignee:"Frederic Guillot"``
ja: - フルネームで検索: ``assignee:"Frederic Guillot"``

source: - Result on success: **list of metadata**
ja: - 成功時の返り値: **メタデータのリスト**

source: - Purpose: **Get assigned tags to a task**
ja: - 用途: **タスクに割り当てられたタグを取得する**

source: - **Tags**: The list of tags associated to tasks.
ja: - **タグ**: 関連づけられるタグの一覧です。

source: - To send emails, you must use the SMTP method or a plugin like Mailgun/Sendgrid/Postmark
ja: - EMailを送るには、SMTPを使用するか、Mailgun/Sendgrid/Postmarkプラグインを使用しなければなりません。

source: - `Google Authenticator <https://github.com/google/google-authenticator/>`__ (Android, iOS, Blackberry)
ja: - `Google 認証システム <https://github.com/google/google-authenticator/>`__ (Android, iOS, Blackberry)

source: Note: When the task is closed, all subtasks are changed to the status **Done**.
ja: 注意: タスクが完了したとき、すべてのサブタスクの状態は **完了** に変更されます。

source: - Follow the official documentation of RabbitMQ for the installation and the configuration
ja: - RabbitMQ の公式文書に従ってインストールと設定をしてください。

source: // LDAP Base DN for groups define('LDAP_GROUP_BASE_DN', '');
ja: // グループのLDAP Base DN define('LDAP_GROUP_BASE_DN', '');

source: - Assign the task to the person who does the action
ja: - アクションを起こしたユーザーを担当者にする

source: - Parameters: None
ja: - パラメータ: 無し

source: - Assign a color when the task is moved to a specific column
ja: - タスクが特定のカラムに移動した時の色を設定

source: The email footer will contain a link to the Kanboard task.
ja: Emailのフッターには、Kanboardのタスクへのリンクが記載されます。

source: The plugin may raise an exception if something goes wrong:
ja: 何か間違いがあった時、プラグインは例外を上げるでしょう:

source: - Find tasks by project id: ``project:23``
ja: - プロジェクトIDで検索: ``project:23``

source: - The process must have access to the data folder if you store files on the local filesystem or use Sqlite
ja: - ローカルのファイルシステム上にファイルを保存する、あるいはSqliteを使用している場合は、そのプロセスがデータフォルダにアクセスする必要があります。

source: - Result on success: **Dictionary of tags**
ja: - 成功時の返り値: **タグの連想配列**

source: To register your new mail transport, use the method ``setTransport($transport, $class)`` from the class ``Kanboard\Core\Mail\Client``:
ja: 新しいメール送信を登録するには、 ``Kanboard\Core\Mail\Client`` クラスの ``setTransport($transport, $class)`` メソッドを使用してください:

source: - **Title**: The title of your task, which will be displayed on the board.
ja: - **タイトル**: ボード上に表示されるタスク名です。

source: // The default Kanboard admin for your organization.
ja: // 組織で既定のKanboardの管理者を指定します。

source: - Multiple phases, each column represents a step
ja: - 複数のフェーズで構成され、各カラムは段階を表します

source: +------------------------------+-----------------------------------------------------------------------------+ | Variable | Description | +==============================+=============================================================================+ | ``DATABASE_URL`` | ``[database type]://[username]:[password]@[host]:[port]/[database name]``, | | | example: ``postgres://foo:foo@myserver:5432/kanboard`` | +------------------------------+-----------------------------------------------------------------------------+ | ``DEBUG`` | Enable/Disable debug mode: ``true`` or ``false`` | +------------------------------+-----------------------------------------------------------------------------+ | ``API_AUTHENTICATION_TOKEN`` | Custom API token | +------------------------------+-----------------------------------------------------------------------------+
ja: +--------------------------+-----------------------------------------------------------------------------+ | 変数 | 概要 | +==========================+=============================================================================+ | DATABASE\_URL | ``[database type]://[username]:[password]@[host]:[port]/[database name]``, | | | 例: ``postgres://foo:foo@myserver:5432/kanboard`` | +--------------------------+-----------------------------------------------------------------------------+ | DEBUG | デバッグモードの有効化/無効化: ``true`` or ``false`` | +--------------------------+-----------------------------------------------------------------------------+ | API_AUTHENTICATION_TOKEN | カスタムAPIトークン | +--------------------------+-----------------------------------------------------------------------------+

source: Short answer: No.
ja: 簡潔な答え: No.

source: - Uses velocity as default metric
ja: - デフォルトでは測定基準に速度を使用

source: Board View ~~~~~~~~~~
ja: ボードビュー ~~~~~~~~~~

source: Create a database ~~~~~~~~~~~~~~~~~
ja: データベースの作成 ~~~~~~~~~~~~~~~~~

source: Go to the menu **settings** and click on the link **Optimize the database**.
ja: メニューの **設定** を開いてから、 **データベースの最適化** を選択してください。

source: Example of template override:
ja: テンプレートのオーバーライドの例:

source: Set up PHP for Apache:
ja: Apache に PHPをセットアップする:

source: - ``%d`` is used to replace an integer
ja: - ``%d`` は整数(integer)の置き換えに使用されます。

source: Task modification:
ja: タスクの変更:

source: To facilitate LDAP integration, Kanboard has its own LDAP library.
ja: LDAPの統合を容易にするため、 Kanboard は自身で LDAP ライブラリを持ちます。

source: Notifications are shown in a list, so you can mark individual notification as read or everything.
ja: 通知はリスト形式で表示され、個別の通知毎にマークを入れていくことも、一括で既読にすることもできます。

source: php-cgi under Apache does not pass HTTP Basic user/pass to PHP by default.
ja: デフォルトでは、Apache下のphp-cgiはHTTP Basic user/passはPHPに通りません。

source: Test with Sqlite ~~~~~~~~~~~~~~~~
ja: Sqlite を使用したテスト ~~~~~~~~~~~~~~~~

source: It’s very easy: you just have to find a name for your project!
ja: とても簡単です:分かりやすいプロジェクト名をつけるだけです!

source: You can add new commands from your plugin:
ja: プラグインから新しいコマンドを追加することができます::

source: - Kanboard roles are mapped to LDAP groups
ja: - Kanboardの役割をマップするLDAPグループ

source: Emails will be sent to all users with notifications enabled.
ja: 通知を有効にしたすべてのユーザーにemailを送信します。

source: This information is recorded in a separate table.
ja: この情報は別表に記録されます。

source: This documentation is generated with Sphinx and pushed automatically on [Read the Docs](https://readthedocs.org/).
ja: この文書はSphinxによって生成され、自動的に [Read the Docs](https://readthedocs.org/) に送信されます。(訳注:日本語訳は未対応)

source: User and application API ------------------------
ja: ユーザーとアプリケーションAPI ------------------------

source: - **identifier** (string, optional)
ja: - **identifier** (string, 任意)

source: Kanboard can be used to manage tasks stored in another system.
ja: Kanboard は別のシステムに保存されているタスクの管理に使用可能です。

source: - Developing a native mobile application for each platform (iOS/Android) for each device type (Smartphone/Tablet) require a lot of work and money.
ja: - 個々のプラットフォーム(iOS/Android)・デバイスのタイプ(スマートフォン/タブレット)向けにネイティブモバイルアプリケーションを開発するには、多くの作業とお金が必要です。

source: - The documentation source code is available here: `<https://github.com/kanboard/documentation>`_.
ja: - 文書のソースコードは `<https://github.com/kanboard/documentation>`_ にあります。

source: The PHPUnit config file is ``tests/units.postgres.xml``.
ja: PHPUnit の設定ファイルは ``tests/units.postgresql.xml`` です。

source: - The Google method implements ``OAuthAuthenticationProviderInterface``
ja: - グーグルを利用するメソッドでの実装は ``OAuthAuthenticationProviderInterface`` です。

source: - Switch to the board view = **v b** (press on **v** then **b**)
ja: - ボードビューに切り替え = **v b** ( **v** キー押下に続けて **b** キー押下)

source: - Multiple assignee lookup: ``assignee:user1 assignee:"John Doe"``
ja: - 複数の担当者を調べる: ``assignee:user1 assignee:"John Doe"``

source: Enable/Disable Project RSS Feeds --------------------------------
ja: プロジェクトのRSSフィードを有効化/無効化する --------------------------------

source: Modify ``.htaccess`` if needed (f.e.
ja: 必要ならば ``.htaccess`` ファイルも修正する (例:

source: figure:: /_static/user-repartition.png :alt: User repartition
ja: figure:: /_static/user-repartition.png :alt: 担当者分布

source: Importing SQL dump (alternative method) ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
ja: SQLダンプのインポート (別の方法) ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

source: - Result on success: **Color properties**
ja: - 成功時の返り値: **色のプロパティ**

source: Collapsed and Expanded Cards ----------------------------
ja: 簡略表示と詳細表示 ----------------------------

source: All missing and unused translations are displayed on the screen.
ja: 全ての未翻訳箇所と、未使用の翻訳箇所が画面上に表示されます。

source: Feel free to comment, fork and suggest updates!
ja: コメント、フォーク、アップデートの提案はご自由にどうぞ!

source: - Your work is displayed on a board so that you have a clear overview of your project
ja: - 作業がボード上で視覚化されることにより、プロジェクトの概要が明確になります。

source: Allow people to change the task status only in specific columns '''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
ja: 特定のカラム内でのみタスクの状態の変更を許可する '''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''

source: - date_due
ja: - 期限

source: +---------------------+-------------------------------------------------+ | Method | Usage | +=====================+=================================================+ | ``getUri()`` | Return Uniform Resource Identifier for the task | +---------------------+-------------------------------------------------+ | ``getFormValues()`` | Return a dict to populate the task form | +---------------------+-------------------------------------------------+
ja: +---------------------+-------------------------------------------------+ | メソッド | 使用方法 | +=====================+=================================================+ | ``getUri()`` | タスクのURIを返す | +---------------------+-------------------------------------------------+ | ``getFormValues()`` | タスクのフォームを埋めているデータを連想配列で返す | +---------------------+-------------------------------------------------+

source: - The column
ja: - カラム

source: You can also disable public access whenever you want.
ja: いつでも公開アクセスを無効化することもできます。

source: - Limits help identify bottlenecks
ja: - ボトルネックの特定を助けます

source: - Check if the files have the correct permissions
ja: - ファイルに正しくアクセス権が割り当てられているか確認する

source: figure:: /_static/groups-management.png :alt: Group Management
ja: figure:: /_static/groups-management.png :alt: グループの管理

source: - Result on success: **List of categories**
ja: - 成功時の返り値: **カテゴリのリスト**

source: Only people who have the correct URL can see the board.
ja: 正しいURLを知っているだけで、ボードを閲覧できます。

source: This example allows only people members of the group “Kanboard Users” to connect to Kanboard.
ja: この例では、 "Kanboard Users" グループのメンバーだけがKanboardに接続できます。

source: Install PHP and Apache:
ja: PHPとApacheをインストールする:

source: You can send notifications to almost any system by adding a new type.
ja: 新しく通知のタイプを追加することで、だいたいどんなシステムにも通知を送ることができます。

source: // Username of the admin, by default blank
ja: // 管理者のユーザー名。デフォルトは空白

source: - The same apply for the user interface, **simplicity and efficiency**.
ja: - 同様にユーザーインターフェースも、 **単純で効率的** を目指しています。

source: figure:: /_static/thunderbird-new-calendar-step1.png :alt: Thunderbird Step 1
ja: figure:: /_static/thunderbird-new-calendar-step1.png :alt: Thunderbird (ステップ1)

source: Bold and italic ---------------
ja: 強調(太字・斜体) ---------------

source: # Open your browser heroku open
ja: # ブラウザを開く heroku open

source: // Mysql/Postgres custom port (null = default port)
ja: // Mysql/Postgres のポート番号 (null = デフォルトのポート)

source: // Since everything should be filtered by the reverse proxy, // you should want to have a bootstrap admin user.
ja: // リバースプロキシによって全てフィルタリングされるべきなので、 // ブートストラップの管理ユーザーを持つべきです。

source: - In the dialog box, choose **On the Network**
ja: - ダイアログボックス内で、 **On the Network** を選択する

source: - There is no user session on the server
ja: - サーバーにユーザーのセッションを持たない

source: Install a plugin ~~~~~~~~~~~~~~~~
ja: プラグインをインストールする ~~~~~~~~~~~~~~~~

source: Example: ``updatedRange:2018/01/21..2018/01/31`` or ``updatedRange:"2018-01-21..2018-01-31"``
ja: 例: ``updatedRange:2018/01/21..2018/01/31`` か ``updatedRange:"2018-01-21..2018-01-31"``

source: - **tags** List of tags ([]string)
ja: - **tags** タグのリスト ([]string)

source: warning:: Since Kanboard v1.2.8, the plugin directory is disabled by default for security reasons.
ja: 警告:: Kanboard v1.2.8 以降では、セキュリティ上の理由でプラグインディレクトリはデフォルトで無効になっています。

source: - People can download the archive directly from GitHub.
ja: - ユーザーはGitHubから直接アーカイブをダウンロードできます。

source: When the authentication is successful, your driver must return an object that represents the user.
ja: 認証が成功した時、あなたのドライバはオブジェクトを返してユーザーに再提供しなければなりません。

source: - Users that belong to this role will be able to change the task status in the column “Backlog”.
ja: - この役割を割り当てられたユーザーは、カラム"Backlog"でのみタスクの状態を変更できます。

source: figure:: /_static/subtask-time-tracking.png :alt: Subtask time tracking
ja: figure:: /_static/subtask-time-tracking.png :alt: サブタスクの時間追跡

source: To have the best performances, choose a provider with fast disk I/O because Kanboard use Sqlite by default.
ja: KanboardはデフォルトでSQLiteを使用しているため、最良のパフォーマンスを得るには、disk I/Oが早いサービスを選んでください。

source: - Other methods can be provided by external plugins: Postmark, Sendgrid and Mailgun
ja: - 外部プラグインで提供されている、その他の方法: Postmark, Sendgrid, Mailgun

source: Email Transports ----------------
ja: Email の配送 ----------------

source: - **user_id** (integer, required)
ja: - **user_id** (integer, 必須)

source: - Monitor the log file
ja: - ログファイルを監視する

source: - You are using a domain name with an underscore: ``kanboard_something.mycompany.tld``
ja: - ドメイン名にアンダースコア(_)を使用している: ``kanboard_something.mycompany.tld``

source: - Result on success: **project properties**
ja: - 成功時の返り値: **プロジェクトのプロパティ**

source: - The database is fragmented due to frequent inserts or updates.
ja: - 挿入と更新を繰り返すことでデータベースが断片化します。

source: Do not allow people to change task status in a specific column ''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
ja: 特定のカラムではタスクの状態の変更を許可しない ''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''

source: If you want to enable the logging, you have to set a log driver.
ja: ログ生成を有効にしたいならば、ログドライバをセットしなければなりません。

source: Execute this command: ``tail -f /var/log/messages``.
ja: コマンド: ``tail -f /var/log/messages`` を実行する。

source: - ``AuthenticationManager::EVENT_FAILURE``: Failed authentication
ja: - ``AuthenticationManager::EVENT_FAILURE``: 認証失敗

source: When this option is enabled, a user can work with only one subtask at the time.
ja: このオプションを有効にすると、一人のユーザーは一度の一つのサブタスクのみ作業できるようになります。

source: Go to http://localhost/ you should see a blank page with the text “It works!”.
ja: http://localhost/ を開いたら、"It Works!"とだけ書かれたページが表示されるはずです。

source: _source-1:
ja: _ソース1-:

source: The file ``config.php`` should contains these values:
ja: ``config.php`` にはこれらの値が含まれるべきです:

source: - Result on success: **List of projects**
ja: - 成功時の返り値: **プロジェクトのリスト**

source: - Purpose: **Revoke group access to a project**
ja: - 用途: **グループからプロジェクトへのアクセス権を剥奪する**

source: How to translate Kanboard to a new language?
ja: どうすればKanboardに新しい翻訳を追加できますか？

source: User Mentions -------------
ja: 他のユーザーの言及 -------------

source: The file ``app/Schema/Sql/postgres.sql`` is a SQL dump that represents the last version of the database.
ja: ``app/Schema/Sql/postgres.sql.sql`` ファイルは、データベースの最終バージョンに相当するSQLダンプです。

source: - **password** Must have at least 6 characters (string, required)
ja: - **password** 少なくとも6文字は必要です (string, 必須)

source: You could improve existing translations or add new ones.
ja: 既にある翻訳を改良したり、新しく追加できます。

source: - ``-p|--project project_id|identifier``: Send notifications only for the given project
ja: - ``-p|--project プロジェクトID|識別子``: 指定したプロジェクトのみの通知を送信

source: Compatible Web Servers ~~~~~~~~~~~~~~~~~~~~~~
ja: 互換性のあるWebサーバー ~~~~~~~~~~~~~~~~~~~~~~

source: - Result on success: **role name**
ja: - 成功時の返り値: **role name**

source: After creating your filter, it will appear on the board next to the default filters:
ja: カスタムフィルタを作成した後は、デフォルトのフィルタの隣に表示されます:

source: - Result on success: **board properties**
ja: - 成功時の返り値: **ボードのプロパティ**

source: _source-2:
ja: _ソース2:

source: # Download the latest release from https://github.com/kanboard/kanboard/releases
ja: # https://github.com/kanboard/kanboard/releases より最新リリースをダウンロードする

source: Example of feature that may slow down Kanboard:
ja: Kanboardの速度低下を起こしうる機能の例:

source: - **name** (string, required)
ja: - **name** (string, 必須)

source: Plugin Overrides ================
ja: プラグインのオーバーライド ================

source: This method uses the credentials provided by the end-user.
ja: この方法はエンドユーザーから供給された認証情報を使用します。

source: Some features of Kanboard requires that you run a daily background job.
ja: - Kanboardのいくつかの特徴は、毎日のバックグラウンドジョブの実行を必要とします。

source: Plugins are stored in the ``plugins`` subdirectory.
ja: プラグインは ``plugins`` サブディレクトリの中に保存されています。

source: - If you got an error about “the library MSVCP110.dll is missing”, you probably need to download the Visual C++ Redistributable for Visual Studio from the Microsoft website.
ja: - “the library MSVCP110.dll is missing”エラーが発生した場合、おそらくVisual C++ Redistributable for Visual Studioを再インストールする必要があるでしょう。

source: When you create a **local user**, you have to specify at least those values:
ja: **ローカルユーザー** を作成するときには、最低でも以下を指定しなければなりません。

source: // Available cache drivers are "file" and "memory" define('CACHE_DRIVER', 'memory');
ja: // 利用可能なキャッシュのドライバは"file" と "memory"です。 define('CACHE_DRIVER', 'memory');

source: Setting up your reverse proxy ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
ja: リバースプロキシのセットアップ ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

source: _source-3:
ja: _ソース-3:

source: Authorization Architecture ==========================
ja: 認可アーキテクチャ ==========================

source: In any case, refer to the official Redhat/Centos documentation.
ja: いずれにせよ、Redhat/CentOSの公式文書を参照願います。

source: Remove a plugin ~~~~~~~~~~~~~~~
ja: プラグインを削除する ~~~~~~~~~~~~~~~

source: - **title** (string, optional)
ja: - **title** (string, 任意)

source: - Do not update the software blindly without checking the `ChangeLog <https://github.com/kanboard/kanboard/blob/master/ChangeLog>`__.
ja: - `ChangeLog <https://github.com/kanboard/kanboard/blob/master/ChangeLog>`_ を見ること無しで盲目的なアップデートをしないでください。

source: // Available cache drivers are "file" and "memory"
ja: // 利用可能なキャッシュのドライバは"file" と "memory"です。

source: // Escape html inside markdown text define('MARKDOWN_ESCAPE_HTML', true);
ja: // markdownテキスト中でhtmlエスケープをさせる define('MARKDOWN_ESCAPE_HTML', true);

source: _source-4:
ja: _ソース4:

source: HTTP proxy configuration:
ja: HTTPプロキシの設定:
